# Loading the Data

In [1]:
import pandas as pd

In [2]:
import warnings 
warnings.filterwarnings('ignore')

In [7]:
df=pd.read_csv("sales_data_uncleaned.csv")
df

,OrderID,Date,CustomerName,Product,Category,Quantity,Price,Total,City
0,1001,05-01-2024,John Doe,Laptop,Electronics,1.0,800,NaN,New York
1,1002,06-01-2024,Jane Smith,Mobile,Electronics,2.0,500,1000.0,los angeles
2,1003,07-01-2024,NaN,Shoes,Fashion,3.0,50,150.0,Chicago
3,1004,07-01-2024,Emily Davis,T-shirt,Fashion,2.0,25,50.0,Boston
4,1005,08-01-2024,Michael Brown,Headphones,Electronics,1.0,100,100.0,new york
5,1006,08-01-2024,Chris Green,Laptop,Electronics,NaN,800,NaN,Los Angeles
6,1007,09-01-2024,Sarah Lee,Shoes,Fashion,1.0,55,55.0,Chicago
7,1008,10-01-2024,David Wilson,Laptop,Electronics,1.0,850,850.0,LOS ANGELES
8,1009,10-01-2024,Linda Taylor,T-shirt,Fashion,2.0,25,NaN,Boston
9,1010,11-01-2024,John Doe,NaN,Electronics,1.0,200,200.0,New York

In [8]:
type(df)

pandas.core.frame.DataFrame

In [17]:
#While loading, set the first column (OrderID) as the index.


df = pd.read_csv("sales_data_uncleaned.csv", index_col="OrderID")
df

,Date,CustomerName,Product,Category,Quantity,Price,Total,City
OrderID,,,,,,,,
1001,05-01-2024,John Doe,Laptop,Electronics,1.0,800,NaN,New York
1002,06-01-2024,Jane Smith,Mobile,Electronics,2.0,500,1000.0,los angeles
1003,07-01-2024,NaN,Shoes,Fashion,3.0,50,150.0,Chicago
1004,07-01-2024,Emily Davis,T-shirt,Fashion,2.0,25,50.0,Boston
1005,08-01-2024,Michael Brown,Headphones,Electronics,1.0,100,100.0,new york
1006,08-01-2024,Chris Green,Laptop,Electronics,NaN,800,NaN,Los Angeles
1007,09-01-2024,Sarah Lee,Shoes,Fashion,1.0,55,55.0,Chicago
1008,10-01-2024,David Wilson,Laptop,Electronics,1.0,850,850.0,LOS ANGELES
1009,10-01-2024,Linda Taylor,T-shirt,Fashion,2.0,25,NaN,Boston
1010,11-01-2024,John Doe,NaN,Electronics,1.0,200,200.0,New York

In [15]:
#Load only the first 5 rows from the dataset.
df_first5 = df.head(5)
print(df_first5)

               Date   CustomerName     Product     Category  Quantity  Price  \
OrderID
1001     05-01-2024       John Doe      Laptop  Electronics       1.0    800
1002     06-01-2024     Jane Smith      Mobile  Electronics       2.0    500
1003     07-01-2024            NaN       Shoes      Fashion       3.0     50
1004     07-01-2024    Emily Davis     T-shirt      Fashion       2.0     25
1005     08-01-2024  Michael Brown  Headphones  Electronics       1.0    100

          Total         City
OrderID
1001        NaN     New York
1002     1000.0  los angeles
1003      150.0      Chicago
1004       50.0       Boston
1005      100.0     new york

In [18]:
#Load only specific columns: CustomerName, Product, and Total.
df = df[["CustomerName", "Product", "Total"]]
df

          CustomerName     Product   Total
OrderID
1001          John Doe      Laptop     NaN
1002        Jane Smith      Mobile  1000.0
1003               NaN       Shoes   150.0
1004       Emily Davis     T-shirt    50.0
1005     Michael Brown  Headphones   100.0
1006       Chris Green      Laptop     NaN
1007         Sarah Lee       Shoes    55.0
1008      David Wilson      Laptop   850.0
1009      Linda Taylor     T-shirt     NaN
1010          John Doe         NaN   200.0

In [19]:
#Load the dataset and ensure all missing values (NaN) are displayed as "Missing".
df = df.fillna("Missing")
df

          CustomerName     Product    Total
OrderID
1001          John Doe      Laptop  Missing
1002        Jane Smith      Mobile   1000.0
1003           Missing       Shoes    150.0
1004       Emily Davis     T-shirt     50.0
1005     Michael Brown  Headphones    100.0
1006       Chris Green      Laptop  Missing
1007         Sarah Lee       Shoes     55.0
1008      David Wilson      Laptop    850.0
1009      Linda Taylor     T-shirt  Missing
1010          John Doe     Missing    200.0

# Basic Inspection

In [20]:
#Display the first 7 rows of the dataset.
df.head(7)

          CustomerName     Product    Total
OrderID
1001          John Doe      Laptop  Missing
1002        Jane Smith      Mobile   1000.0
1003           Missing       Shoes    150.0
1004       Emily Davis     T-shirt     50.0
1005     Michael Brown  Headphones    100.0
1006       Chris Green      Laptop  Missing
1007         Sarah Lee       Shoes     55.0

In [21]:
#dDisplay the last 3 rows.
df.tail(3)

         CustomerName  Product    Total
OrderID
1008     David Wilson   Laptop    850.0
1009     Linda Taylor  T-shirt  Missing
1010         John Doe  Missing    200.0

In [22]:
# Find the total number of rows and columns.
df.shape

(10, 3)

In [23]:
#Print all the column names as a list.
df.columns.tolist()

['CustomerName', 'Product', 'Total']

In [24]:
#Get the data types (dtype) of each column.
df.dtypes

CustomerName    object
Product         object
Total           object
dtype: object

# Summary & Metadata

In [29]:
#Check if there are any duplicate OrderID values.
#df["OrderID"].duplicated().any()
#df[df["OrderID"].duplicated()]
df.index.duplicated().any()
#df["OrderID"].duplicated().any()

np.False_

In [30]:
#Use .info() to get column details and memory usage.
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, 1001 to 1010
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerName  10 non-null     object
 1   Product       10 non-null     object
 2   Total         10 non-null     object
dtypes: object(3)
memory usage: 620.0+ bytes

In [31]:
#Get a statistical summary of numerical columns (.describe()).
df.describe()

       CustomerName Product    Total
count            10      10       10
unique            9       6        8
top        John Doe  Laptop  Missing
freq              2       3        3

In [32]:
#Get a statistical summary of numerical columns (.describe()).
df.describe(include="object")

       CustomerName Product    Total
count            10      10       10
unique            9       6        8
top        John Doe  Laptop  Missing
freq              2       3        3

In [34]:
df=pd.read_csv("sales_data_uncleaned.csv")
df

,OrderID,Date,CustomerName,Product,Category,Quantity,Price,Total,City
0,1001,05-01-2024,John Doe,Laptop,Electronics,1.0,800,NaN,New York
1,1002,06-01-2024,Jane Smith,Mobile,Electronics,2.0,500,1000.0,los angeles
2,1003,07-01-2024,NaN,Shoes,Fashion,3.0,50,150.0,Chicago
3,1004,07-01-2024,Emily Davis,T-shirt,Fashion,2.0,25,50.0,Boston
4,1005,08-01-2024,Michael Brown,Headphones,Electronics,1.0,100,100.0,new york
5,1006,08-01-2024,Chris Green,Laptop,Electronics,NaN,800,NaN,Los Angeles
6,1007,09-01-2024,Sarah Lee,Shoes,Fashion,1.0,55,55.0,Chicago
7,1008,10-01-2024,David Wilson,Laptop,Electronics,1.0,850,850.0,LOS ANGELES
8,1009,10-01-2024,Linda Taylor,T-shirt,Fashion,2.0,25,NaN,Boston
9,1010,11-01-2024,John Doe,NaN,Electronics,1.0,200,200.0,New York

In [36]:
#Find the maximum and minimum values in the Price column.
print(df["Price"].min())
print(df["Price"].max())

25
850

# Exploration

In [37]:
#Count how many unique customers are in the dataset.
df["CustomerName"].nunique()

8

In [38]:
#Find the unique values in the Category column.
df["Category"].unique()

array(['Electronics', 'Fashion'], dtype=object)

In [39]:
#Count how many times each product appears in the dataset.
df["Product"].value_counts(sort=False)

Product
Laptop        3
Mobile        1
Shoes         2
T-shirt       2
Headphones    1
Name: count, dtype: int64

In [40]:
#Show the frequency of each city.
df["City"].value_counts()

City
New York       2
Chicago        2
Boston         2
los angeles    1
new york       1
Los Angeles    1
LOS ANGELES    1
Name: count, dtype: int64

In [41]:
#Check if the dataset contains any null values (.isnull().sum()).
df.isnull().sum()

OrderID         0
Date            0
CustomerName    1
Product         1
Category        0
Quantity        1
Price           0
Total           3
City            0
dtype: int64